{"0 - 297.29": "Hello people, in our episode today we would like to recommend three shows that you can watch with German subtitles. People keep asking us what can we watch if we want to learn German and that is actually not that easy at Easy German we do it very precisely and till  so that you can really read every word and every cell and that is very important to understand but if you watch an fx series or a movie or a television series and then turn on the subtitles then they are not always precise because maybe that's what people are made for  understand the content and not necessarily that they are transcribed one-to-one and that's why we have three tips for you today that you can watch with relatively good subtitles. The first show that I would like to recommend to you is called Thesen Temperamente and it is my favorite show on German television  I really enjoy watching it because it's about art, culture and politics. There are always five to six minute contributions, for example about a new book, a film or about an artist, and the whole thing also has pretty precise German subtitles. Depending on the contribution, of course the vocabulary varies  a little higher or a little more difficult to understand but I think it's quite interesting to see which topics are politically interesting or relevant in Germany. Below I'll post the link to this program and it may be that this link doesn't work in all countries Because it may be blocked in other countries, in this case you have to see how you can do it so that it looks like you are looking at this offer from a German IP address. Maybe a few others of you can post a tip or a link here  How you can do that My time recommendation is a YouTube channel called Germania and on this YouTube channel there is a new episode every week and in this episode a person from Germany with a migration background is introduced, i.e. a person who was either not born in Germany themselves  or whose parents immigrated from another country and I find this project very interesting because it shows the diversity of Germany but also the diversity in these different groups. Often the political debate is always about Germans and foreigners and that's what I think  I fell far short because there is of course a big difference whether someone comes from Poland or from Tunisia or whether someone came to Germany voluntarily or not voluntarily, whether they have lived here with their family for generations or alone and I find it really very exciting The whole thing is also interesting for you to understand. The under are about 90% precise, so I don't think it's entirely precise, but because the episodes are very short and only have one speaker, it's very easy to understand and at the same time it's always about these questions  family identity home also a good accessible vocabulary take a look the link is below my third recommendation for you is the leak deep this is a YouTube channel and reports are published every week, mostly from Germany, these reports are always around 15 to 25 minutes long and they are completely subtitled and the reports are about presenting different lifestyles, i.e. people who have a special job or live with an illness or who live in a special way. You can see, for example, what the everyday life of a police officer is like Germany from or the everyday life of a homeless person two topics that I found interesting were programs in which the lives of political radicals were presented, for example a former neo-Nazi and a group of left-wing radicals, really very exciting topics that also show what Germany looks like in this age and look  Take a look at it and look at the reports. There is also a link down here. Yes, those were our three recommendations. Take a look at them and I would", "297.29 - 331.71999999999997": "comment on whether you find these three programs interesting  They are helpful and of course we would also like to hear your tips. What are you watching? If you wanted to watch German series or films or programs, post your comments below and maybe we can put together a very interesting collection of links for you. Here you can become a member of easy  german at patchen you get exercises, transcripts, vocabulary lists every week and you can subscribe to us here. We'll be happy if you tune in again next week"}